FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M4F_TM4C123G_Launchpad_GCC/driverlib/rom_map.h
//*****************************************************************************
//
// Macros for the SMBus API.
//
//*****************************************************************************
#ifdef ROM_SMBusMasterIntProcess
#define MAP_SMBusMasterIntProcess                                             \
        ROM_SMBusMasterIntProcess
#else
#define MAP_SMBusMasterIntProcess                                             \
        SMBusMasterIntProcess
#endif
#ifdef ROM_SMBusARPDisable
#define MAP_SMBusARPDisable                                                   \
        ROM_SMBusARPDisable
#else
#define MAP_SMBusARPDisable                                                   \
        SMBusARPDisable
#endif
#ifdef ROM_SMBusARPEnable
#define MAP_SMBusARPEnable                                                    \
        ROM_SMBusARPEnable
#else
#define MAP_SMBusARPEnable                                                    \
        SMBusARPEnable
#endif
#ifdef ROM_SMBusARPUDIDPacketDecode
#define MAP_SMBusARPUDIDPacketDecode                                          \
        ROM_SMBusARPUDIDPacketDecode
#else
#define MAP_SMBusARPUDIDPacketDecode                                          \
        SMBusARPUDIDPacketDecode
#endif
#ifdef ROM_SMBusARPUDIDPacketEncode
#define MAP_SMBusARPUDIDPacketEncode                                          \
        ROM_SMBusARPUDIDPacketEncode
#else
#define MAP_SMBusARPUDIDPacketEncode                                          \
        SMBusARPUDIDPacketEncode
#endif
#ifdef ROM_SMBusMasterARPAssignAddress
#define MAP_SMBusMasterARPAssignAddress                                       \
        ROM_SMBusMasterARPAssignAddress
#else
#define MAP_SMBusMasterARPAssignAddress                                       \
        SMBusMasterARPAssignAddress
#endif
#ifdef ROM_SMBusMasterARPGetUDIDDir
#define MAP_SMBusMasterARPGetUDIDDir                                          \
        ROM_SMBusMasterARPGetUDIDDir
#else
#define MAP_SMBusMasterARPGetUDIDDir                                          \
        SMBusMasterARPGetUDIDDir
#endif
#ifdef ROM_SMBusMasterARPGetUDIDGen
#define MAP_SMBusMasterARPGetUDIDGen                                          \
        ROM_SMBusMasterARPGetUDIDGen
#else
#define MAP_SMBusMasterARPGetUDIDGen                                          \
        SMBusMasterARPGetUDIDGen
#endif
#ifdef ROM_SMBusMasterARPNotifyMaster
#define MAP_SMBusMasterARPNotifyMaster                                        \
        ROM_SMBusMasterARPNotifyMaster
#else
#define MAP_SMBusMasterARPNotifyMaster                                        \
        SMBusMasterARPNotifyMaster
#endif
#ifdef ROM_SMBusMasterARPPrepareToARP
#define MAP_SMBusMasterARPPrepareToARP                                        \
        ROM_SMBusMasterARPPrepareToARP
#else
#define MAP_SMBusMasterARPPrepareToARP                                        \
        SMBusMasterARPPrepareToARP
#endif
#ifdef ROM_SMBusMasterARPResetDeviceDir
#define MAP_SMBusMasterARPResetDeviceDir                                      \
        ROM_SMBusMasterARPResetDeviceDir
#else
#define MAP_SMBusMasterARPResetDeviceDir                                      \
        SMBusMasterARPResetDeviceDir
#endif
#ifdef ROM_SMBusMasterARPResetDeviceGen
#define MAP_SMBusMasterARPResetDeviceGen                                      \
        ROM_SMBusMasterARPResetDeviceGen
#else
#define MAP_SMBusMasterARPResetDeviceGen                                      \
        SMBusMasterARPResetDeviceGen
#endif
#ifdef ROM_SMBusMasterBlockProcessCall
#define MAP_SMBusMasterBlockProcessCall                                       \
        ROM_SMBusMasterBlockProcessCall
#else
#define MAP_SMBusMasterBlockProcessCall                                       \
        SMBusMasterBlockProcessCall
#endif
#ifdef ROM_SMBusMasterBlockRead
#define MAP_SMBusMasterBlockRead                                              \
        ROM_SMBusMasterBlockRead
#else
#define MAP_SMBusMasterBlockRead                                              \
        SMBusMasterBlockRead
#endif
#ifdef ROM_SMBusMasterBlockWrite
#define MAP_SMBusMasterBlockWrite                                             \
        ROM_SMBusMasterBlockWrite
#else
#define MAP_SMBusMasterBlockWrite                                             \
        SMBusMasterBlockWrite
#endif
#ifdef ROM_SMBusMasterByteReceive
#define MAP_SMBusMasterByteReceive                                            \
        ROM_SMBusMasterByteReceive
#else
#define MAP_SMBusMasterByteReceive                                            \
        SMBusMasterByteReceive
#endif
#ifdef ROM_SMBusMasterByteSend
#define MAP_SMBusMasterByteSend                                               \
        ROM_SMBusMasterByteSend
#else
#define MAP_SMBusMasterByteSend                                               \
        SMBusMasterByteSend
#endif
#ifdef ROM_SMBusMasterByteWordRead
#define MAP_SMBusMasterByteWordRead                                           \
        ROM_SMBusMasterByteWordRead
#else
#define MAP_SMBusMasterByteWordRead                                           \
        SMBusMasterByteWordRead
#endif
#ifdef ROM_SMBusMasterByteWordWrite
#define MAP_SMBusMasterByteWordWrite                                          \
        ROM_SMBusMasterByteWordWrite
#else
#define MAP_SMBusMasterByteWordWrite                                          \
        SMBusMasterByteWordWrite
#endif
#ifdef ROM_SMBusMasterHostNotify
#define MAP_SMBusMasterHostNotify                                             \
        ROM_SMBusMasterHostNotify
#else
#define MAP_SMBusMasterHostNotify                                             \
        SMBusMasterHostNotify
#endif
#ifdef ROM_SMBusMasterI2CRead
#define MAP_SMBusMasterI2CRead                                                \
        ROM_SMBusMasterI2CRead
#else
#define MAP_SMBusMasterI2CRead                                                \
        SMBusMasterI2CRead
#endif
#ifdef ROM_SMBusMasterI2CWrite
#define MAP_SMBusMasterI2CWrite                                               \
        ROM_SMBusMasterI2CWrite
#else
#define MAP_SMBusMasterI2CWrite                                               \
        SMBusMasterI2CWrite
#endif
#ifdef ROM_SMBusMasterI2CWriteRead
#define MAP_SMBusMasterI2CWriteRead                                           \
        ROM_SMBusMasterI2CWriteRead
#else
#define MAP_SMBusMasterI2CWriteRead                                           \
        SMBusMasterI2CWriteRead
#endif
#ifdef ROM_SMBusMasterInit
#define MAP_SMBusMasterInit                                                   \
        ROM_SMBusMasterInit
#else
#define MAP_SMBusMasterInit                                                   \
        SMBusMasterInit
#endif
#ifdef ROM_SMBusMasterIntEnable
#define MAP_SMBusMasterIntEnable                                              \
        ROM_SMBusMasterIntEnable
#else
#define MAP_SMBusMasterIntEnable                                              \
        SMBusMasterIntEnable
#endif
#ifdef ROM_SMBusMasterProcessCall
#define MAP_SMBusMasterProcessCall                                            \
        ROM_SMBusMasterProcessCall
#else
#define MAP_SMBusMasterProcessCall                                            \
        SMBusMasterProcessCall
#endif
#ifdef ROM_SMBusMasterQuickCommand
#define MAP_SMBusMasterQuickCommand                                           \
        ROM_SMBusMasterQuickCommand
#else
#define MAP_SMBusMasterQuickCommand                                           \
        SMBusMasterQuickCommand
#endif
#ifdef ROM_SMBusPECDisable
#define MAP_SMBusPECDisable                                                   \
        ROM_SMBusPECDisable
#else
#define MAP_SMBusPECDisable                                                   \
        SMBusPECDisable
#endif
#ifdef ROM_SMBusPECEnable
#define MAP_SMBusPECEnable                                                    \
        ROM_SMBusPECEnable
#else
#define MAP_SMBusPECEnable                                                    \
        SMBusPECEnable
#endif
#ifdef ROM_SMBusRxPacketSizeGet
#define MAP_SMBusRxPacketSizeGet                                              \
        ROM_SMBusRxPacketSizeGet
#else
#define MAP_SMBusRxPacketSizeGet                                              \
        SMBusRxPacketSizeGet
#endif
#ifdef ROM_SMBusSlaveACKSend
#define MAP_SMBusSlaveACKSend                                                 \
        ROM_SMBusSlaveACKSend
#else
#define MAP_SMBusSlaveACKSend                                                 \
        SMBusSlaveACKSend
#endif
#ifdef ROM_SMBusSlaveAddressSet
#define MAP_SMBusSlaveAddressSet                                              \
        ROM_SMBusSlaveAddressSet
#else
#define MAP_SMBusSlaveAddressSet                                              \
        SMBusSlaveAddressSet
#endif
#ifdef ROM_SMBusSlaveARPFlagARGet
#define MAP_SMBusSlaveARPFlagARGet                                            \
        ROM_SMBusSlaveARPFlagARGet
#else
#define MAP_SMBusSlaveARPFlagARGet                                            \
        SMBusSlaveARPFlagARGet
#endif
#ifdef ROM_SMBusSlaveARPFlagARSet
#define MAP_SMBusSlaveARPFlagARSet                                            \
        ROM_SMBusSlaveARPFlagARSet
#else
#define MAP_SMBusSlaveARPFlagARSet                                            \
        SMBusSlaveARPFlagARSet
#endif
#ifdef ROM_SMBusSlaveARPFlagAVGet
#define MAP_SMBusSlaveARPFlagAVGet                                            \
        ROM_SMBusSlaveARPFlagAVGet
#else
#define MAP_SMBusSlaveARPFlagAVGet                                            \
        SMBusSlaveARPFlagAVGet
#endif
#ifdef ROM_SMBusSlaveARPFlagAVSet
#define MAP_SMBusSlaveARPFlagAVSet                                            \
        ROM_SMBusSlaveARPFlagAVSet
#else
#define MAP_SMBusSlaveARPFlagAVSet                                            \
        SMBusSlaveARPFlagAVSet
#endif
#ifdef ROM_SMBusSlaveBlockTransferDisable
#define MAP_SMBusSlaveBlockTransferDisable                                    \
        ROM_SMBusSlaveBlockTransferDisable
#else
#define MAP_SMBusSlaveBlockTransferDisable                                    \
        SMBusSlaveBlockTransferDisable
#endif
#ifdef ROM_SMBusSlaveBlockTransferEnable
#define MAP_SMBusSlaveBlockTransferEnable                                     \
        ROM_SMBusSlaveBlockTransferEnable
#else
#define MAP_SMBusSlaveBlockTransferEnable                                     \
        SMBusSlaveBlockTransferEnable
#endif
#ifdef ROM_SMBusSlaveCommandGet
#define MAP_SMBusSlaveCommandGet                                              \
        ROM_SMBusSlaveCommandGet
#else
#define MAP_SMBusSlaveCommandGet                                              \
        SMBusSlaveCommandGet
#endif
#ifdef ROM_SMBusSlaveI2CDisable
#define MAP_SMBusSlaveI2CDisable                                              \
        ROM_SMBusSlaveI2CDisable
#else
#define MAP_SMBusSlaveI2CDisable                                              \
        SMBusSlaveI2CDisable
#endif
#ifdef ROM_SMBusSlaveI2CEnable
#define MAP_SMBusSlaveI2CEnable                                               \
        ROM_SMBusSlaveI2CEnable
#else
#define MAP_SMBusSlaveI2CEnable                                               \
        SMBusSlaveI2CEnable
#endif
#ifdef ROM_SMBusSlaveInit
#define MAP_SMBusSlaveInit                                                    \
        ROM_SMBusSlaveInit
#else
#define MAP_SMBusSlaveInit                                                    \
        SMBusSlaveInit
#endif
#ifdef ROM_SMBusSlaveIntAddressGet
#define MAP_SMBusSlaveIntAddressGet                                           \
        ROM_SMBusSlaveIntAddressGet
#else
#define MAP_SMBusSlaveIntAddressGet                                           \
        SMBusSlaveIntAddressGet
#endif
#ifdef ROM_SMBusSlaveIntEnable
#define MAP_SMBusSlaveIntEnable                                               \
        ROM_SMBusSlaveIntEnable
#else
#define MAP_SMBusSlaveIntEnable                                               \
        SMBusSlaveIntEnable
#endif
#ifdef ROM_SMBusSlaveIntProcess
#define MAP_SMBusSlaveIntProcess                                              \
        ROM_SMBusSlaveIntProcess
#else
#define MAP_SMBusSlaveIntProcess                                              \
        SMBusSlaveIntProcess
#endif
#ifdef ROM_SMBusSlaveManualACKDisable
#define MAP_SMBusSlaveManualACKDisable                                        \
        ROM_SMBusSlaveManualACKDisable
#else
#define MAP_SMBusSlaveManualACKDisable                                        \
        SMBusSlaveManualACKDisable
#endif
#ifdef ROM_SMBusSlaveManualACKEnable
#define MAP_SMBusSlaveManualACKEnable                                         \
        ROM_SMBusSlaveManualACKEnable
#else
#define MAP_SMBusSlaveManualACKEnable                                         \
        SMBusSlaveManualACKEnable
#endif
#ifdef ROM_SMBusSlaveManualACKStatusGet
#define MAP_SMBusSlaveManualACKStatusGet                                      \
        ROM_SMBusSlaveManualACKStatusGet
#else
#define MAP_SMBusSlaveManualACKStatusGet                                      \
        SMBusSlaveManualACKStatusGet
#endif
#ifdef ROM_SMBusSlaveProcessCallDisable
#define MAP_SMBusSlaveProcessCallDisable                                      \
        ROM_SMBusSlaveProcessCallDisable
#else
#define MAP_SMBusSlaveProcessCallDisable                                      \
        SMBusSlaveProcessCallDisable
#endif
#ifdef ROM_SMBusSlaveProcessCallEnable
#define MAP_SMBusSlaveProcessCallEnable                                       \
        ROM_SMBusSlaveProcessCallEnable
#else
#define MAP_SMBusSlaveProcessCallEnable                                       \
        SMBusSlaveProcessCallEnable
#endif
#ifdef ROM_SMBusSlaveRxBufferSet
#define MAP_SMBusSlaveRxBufferSet                                             \
        ROM_SMBusSlaveRxBufferSet
#else
#define MAP_SMBusSlaveRxBufferSet                                             \
        SMBusSlaveRxBufferSet
#endif
#ifdef ROM_SMBusSlaveTransferInit
#define MAP_SMBusSlaveTransferInit                                            \
        ROM_SMBusSlaveTransferInit
#else
#define MAP_SMBusSlaveTransferInit                                            \
        SMBusSlaveTransferInit
#endif
#ifdef ROM_SMBusSlaveTxBufferSet
#define MAP_SMBusSlaveTxBufferSet                                             \
        ROM_SMBusSlaveTxBufferSet
#else
#define MAP_SMBusSlaveTxBufferSet                                             \
        SMBusSlaveTxBufferSet
#endif
#ifdef ROM_SMBusSlaveUDIDSet
#define MAP_SMBusSlaveUDIDSet                                                 \
        ROM_SMBusSlaveUDIDSet
#else
#define MAP_SMBusSlaveUDIDSet                                                 \
        SMBusSlaveUDIDSet
#endif
#ifdef ROM_SMBusStatusGet
#define MAP_SMBusStatusGet                                                    \
        ROM_SMBusStatusGet
#else
#define MAP_SMBusStatusGet                                                    \
        SMBusStatusGet
#endif
#ifdef ROM_SMBusSlaveDataSend
#define MAP_SMBusSlaveDataSend                                                \
        ROM_SMBusSlaveDataSend
#else
#define MAP_SMBusSlaveDataSend                                                \
        SMBusSlaveDataSend
#endif
#ifdef ROM_SMBusFIFOEnable
#define MAP_SMBusFIFOEnable                                                   \
        ROM_SMBusFIFOEnable
#else
#define MAP_SMBusFIFOEnable                                                   \
        SMBusFIFOEnable
#endif
#ifdef ROM_SMBusFIFODisable
#define MAP_SMBusFIFODisable                                                  \
        ROM_SMBusFIFODisable
#else
#define MAP_SMBusFIFODisable                                                  \
        SMBusFIFODisable
#endif
#ifdef ROM_SMBusDMAEnable
#define MAP_SMBusDMAEnable                                                    \
        ROM_SMBusDMAEnable
#else
#define MAP_SMBusDMAEnable                                                    \
        SMBusDMAEnable
#endif
#ifdef ROM_SMBusDMADisable
#define MAP_SMBusDMADisable                                                   \
        ROM_SMBusDMADisable
#else
#define MAP_SMBusDMADisable                                                   \
        SMBusDMADisable
#endif

//*****************************************************************************
//
// Macros for the SPIFlash API.
//
//*****************************************************************************
#ifdef ROM_SPIFlashIntHandler
#define MAP_SPIFlashIntHandler                                                \
        ROM_SPIFlashIntHandler
#else
#define MAP_SPIFlashIntHandler                                                \
        SPIFlashIntHandler
#endif
#ifdef ROM_SPIFlashInit
#define MAP_SPIFlashInit                                                      \
        ROM_SPIFlashInit
#else
#define MAP_SPIFlashInit                                                      \
        SPIFlashInit
#endif
#ifdef ROM_SPIFlashWriteStatus
#define MAP_SPIFlashWriteStatus                                               \
        ROM_SPIFlashWriteStatus
#else
#define MAP_SPIFlashWriteStatus                                               \
        SPIFlashWriteStatus
#endif
#ifdef ROM_SPIFlashPageProgram
#define MAP_SPIFlashPageProgram                                               \
        ROM_SPIFlashPageProgram
#else
#define MAP_SPIFlashPageProgram                                               \
        SPIFlashPageProgram
#endif
#ifdef ROM_SPIFlashPageProgramNonBlocking
#define MAP_SPIFlashPageProgramNonBlocking                                    \
        ROM_SPIFlashPageProgramNonBlocking
#else
#define MAP_SPIFlashPageProgramNonBlocking                                    \
        SPIFlashPageProgramNonBlocking
#endif
#ifdef ROM_SPIFlashRead
#define MAP_SPIFlashRead                                                      \
        ROM_SPIFlashRead
#else
#define MAP_SPIFlashRead                                                      \
        SPIFlashRead
#endif
#ifdef ROM_SPIFlashReadNonBlocking
#define MAP_SPIFlashReadNonBlocking                                           \
        ROM_SPIFlashReadNonBlocking
#else
#define MAP_SPIFlashReadNonBlocking                                           \
        SPIFlashReadNonBlocking
#endif
#ifdef ROM_SPIFlashWriteDisable
#define MAP_SPIFlashWriteDisable                                              \
        ROM_SPIFlashWriteDisable
#else
#define MAP_SPIFlashWriteDisable                                              \
        SPIFlashWriteDisable
#endif
#ifdef ROM_SPIFlashReadStatus
#define MAP_SPIFlashReadStatus                                                \
        ROM_SPIFlashReadStatus
#else
#define MAP_SPIFlashReadStatus                                                \
        SPIFlashReadStatus
#endif
#ifdef ROM_SPIFlashWriteEnable
#define MAP_SPIFlashWriteEnable                                               \
        ROM_SPIFlashWriteEnable
#else
#define MAP_SPIFlashWriteEnable                                               \
        SPIFlashWriteEnable
#endif
#ifdef ROM_SPIFlashFastRead
#define MAP_SPIFlashFastRead                                                  \
        ROM_SPIFlashFastRead
#else
#define MAP_SPIFlashFastRead                                                  \
        SPIFlashFastRead
#endif
#ifdef ROM_SPIFlashFastReadNonBlocking
#define MAP_SPIFlashFastReadNonBlocking                                       \
        ROM_SPIFlashFastReadNonBlocking
#else
#define MAP_SPIFlashFastReadNonBlocking                                       \
        SPIFlashFastReadNonBlocking
#endif
#ifdef ROM_SPIFlashSectorErase
#define MAP_SPIFlashSectorErase                                               \
        ROM_SPIFlashSectorErase
#else
#define MAP_SPIFlashSectorErase                                               \
        SPIFlashSectorErase
#endif
#ifdef ROM_SPIFlashDualRead
#define MAP_SPIFlashDualRead                                                  \
        ROM_SPIFlashDualRead
#else
#define MAP_SPIFlashDualRead                                                  \
        SPIFlashDualRead
#endif
#ifdef ROM_SPIFlashDualReadNonBlocking
#define MAP_SPIFlashDualReadNonBlocking                                       \
        ROM_SPIFlashDualReadNonBlocking
#else
#define MAP_SPIFlashDualReadNonBlocking                                       \
        SPIFlashDualReadNonBlocking
#endif
#ifdef ROM_SPIFlashBlockErase32
#define MAP_SPIFlashBlockErase32                                              \
        ROM_SPIFlashBlockErase32
#else
#define MAP_SPIFlashBlockErase32                                              \
        SPIFlashBlockErase32
#endif
#ifdef ROM_SPIFlashQuadRead
#define MAP_SPIFlashQuadRead                                                  \
        ROM_SPIFlashQuadRead
#else
#define MAP_SPIFlashQuadRead                                                  \
        SPIFlashQuadRead
#endif
#ifdef ROM_SPIFlashQuadReadNonBlocking
#define MAP_SPIFlashQuadReadNonBlocking                                       \
        ROM_SPIFlashQuadReadNonBlocking
#else
#define MAP_SPIFlashQuadReadNonBlocking                                       \
        SPIFlashQuadReadNonBlocking
#endif
#ifdef ROM_SPIFlashReadID
#define MAP_SPIFlashReadID                                                    \
        ROM_SPIFlashReadID
#else
#define MAP_SPIFlashReadID                                                    \
        SPIFlashReadID
#endif
#ifdef ROM_SPIFlashChipErase
#define MAP_SPIFlashChipErase                                                 \
        ROM_SPIFlashChipErase
#else
#define MAP_SPIFlashChipErase                                                 \
        SPIFlashChipErase
#endif
#ifdef ROM_SPIFlashBlockErase64
#define MAP_SPIFlashBlockErase64                                              \
        ROM_SPIFlashBlockErase64
#else
#define MAP_SPIFlashBlockErase64                                              \
        SPIFlashBlockErase64
#endif

